# Pandas 101 (Part 1)

***Author:*** Leandro Ariza (ariza.leandro@gmail.com)

## 1. Introduction

### 1.1. What is Pandas?

- Pandas is a (newer) package built on top of NumPy
- Implements powerful data operations familiar to users of both database frameworks and spreadsheet programs.
- Provides efficient tools for "data munging" tasks that occupy much of a data scientist's time.
- Provides an efficient object for data-storage: `DataFrame`.
- About DataFrames:
    - Multidimensional arrays with attached row and column labels
    - Support heterogeneous types and/or missing data.

### 1.2. Why use Pandas for data manipulation?

- Pandas simplifies data manipulation tasks such as cleaning, transforming, and analyzing data.
- It provides two primary data structures: Series and DataFrame, which are highly versatile for handling one-dimensional and two-dimensional data, respectively.
- Pandas offers a wide range of functions and methods for data manipulation, including data cleaning, selection, aggregation, and visualization.
- It integrates seamlessly with other Python libraries like NumPy, Matplotlib, and scikit-learn, making it a preferred choice for data analysis projects.

## 2. Getting Started with Pandas

### 2.1. Installing Pandas

Before using Pandas, you need to install it. You can install Pandas using `pip`, the Python package manager, by running the following command in your terminal or command prompt:

```bash
pip install pandas
````

In [3]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-2.1.1-cp312-cp312-win_amd64.whl.metadata (59 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\alejo\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\alejo\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
    --------------------------------------- 0.3/11.5 MB ? eta -:--:--
   ------- -------------------------------- 2.1/11.5 MB 7.8 MB/s eta 0:00:02
   ------------------------------ --------- 8.9/11.5 MB 18.5 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 19.5 MB/s eta 0:00:00
Downloading numpy-2.1.1-cp312-cp312-win_amd64.whl (12.6 MB)
   ---------------------------------------- 0.0/12.6 MB ? eta -:--:--
   ------------------------- -------------- 7.9/12.6 MB 40.7 MB/s eta 0:00:01
   ---------------------------------------- 12.6/12.6 MB 37.5 MB/s eta 0:00:00
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.1.1 pandas-2.2.3 pytz-2024.2 tzdata-2024.1

### 2.2. Importing Pandas library

Once installed, you can import the Pandas library into your Python environment using the following convention:

```bash
import pandas as pd
```

Here, `pd` is a commonly used alias for Pandas, which makes it easier to reference Pandas functions and objects in your code.

### 2.3. On Pandas data structures

Pandas provides two main data structures for working with data:

***Series***

A one-dimensional array-like object that can hold any data type, such as integers, floats, strings, or even Python objects. It is similar to a NumPy array but with additional functionality and labeled indices.

***DataFrame***

A two-dimensional labeled data structure with columns of potentially different data types. It is akin to a spreadsheet or SQL table, where each column represents a different variable, and each row represents a different observation.

Here's how you can create a `Series` and a `DataFrame`:

In [4]:
# Creating a Series
import pandas as pd
import numpy as np

s = pd.Series(["a", "b", "5", "", "-", np.nan])
s

0      a
1      b
2      5
3
4      -
5    NaN
dtype: object

In [5]:
# Creating a DataFrame
# (All arrays must be of the same length)
data = {'Name': ['John', 'Emily', 'Jack', 'Sophia'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'Houston', 'Chicago', 'Houston']}
df = pd.DataFrame(data)
df

     Name  Age      City
0    John   25  New York
1   Emily   30   Houston
2    Jack   35   Chicago
3  Sophia   40   Houston

In the above example, `s` is a `Series` containing integers, and `df` is a `DataFrame` containing information about individuals (Name, Age, and City):

In [4]:
type(s)

pandas.core.series.Series

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

### 2.4. Common Attributes for DataFrames and Series

`shape`: Returns a tuple representing the dimensions of the DataFrame or Series (rows, columns). -->

In [8]:
df.shape

(4, 3)

`index`: Returns the index (row labels) of the DataFrame or Series.

In [9]:
df.index

RangeIndex(start=0, stop=4, step=1)

`columns`: Returns the column labels of the DataFrame.

In [10]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

`dtypes`: Returns the data types of each column in the DataFrame.

In [11]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

`values`: Returns the data contained in the DataFrame or Series as a NumPy array.

In [12]:
df.values

array([['John', 25, 'New York'],
       ['Emily', 30, 'Houston'],
       ['Jack', 35, 'Chicago'],
       ['Sophia', 40, 'Houston']], dtype=object)

In [13]:
df.Age.values

array([25, 30, 35, 40], dtype=int64)

### 2.5. Common Methods for DataFrames and Series

`head()`: Returns the first n rows of the DataFrame (by default, n=5).

In [14]:
df.head()

     Name  Age      City
0    John   25  New York
1   Emily   30   Houston
2    Jack   35   Chicago
3  Sophia   40   Houston

`tail()`: Returns the last n rows of the DataFrame (by default, n=5).

In [15]:
df.tail()

     Name  Age      City
0    John   25  New York
1   Emily   30   Houston
2    Jack   35   Chicago
3  Sophia   40   Houston

`info()`: Provides a concise summary of the DataFrame, including data types and memory usage.

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

`describe()`: Generates descriptive statistics for numerical and categorical columns in the DataFrame.

In [17]:
# Numerical by default
# (we can change the percentiles)
df.describe()

             Age
count   4.000000
mean   32.500000
std     6.454972
min    25.000000
25%    28.750000
50%    32.500000
75%    36.250000
max    40.000000

In [18]:
# Numerical by default
df.describe(include="object")

        Name     City
count      4        4
unique     4        3
top     John  Houston
freq       1        2

`sort_values()`: Sorting the data by a specific column.

In [19]:
df.sort_values(by="Age", ascending=False)

     Name  Age      City
3  Sophia   40   Houston
2    Jack   35   Chicago
1   Emily   30   Houston
0    John   25  New York

`set_index()`: Set the DataFrame index (row labels) using one or more existing columns or arrays (of the correct length).

In [20]:
df

     Name  Age      City
0    John   25  New York
1   Emily   30   Houston
2    Jack   35   Chicago
3  Sophia   40   Houston

In [21]:
df = df.set_index("Name")
df

        Age      City
Name
John     25  New York
Emily    30   Houston
Jack     35   Chicago
Sophia   40   Houston

`reset_index()`: Reset the index of the DataFrame, and use the default one instead

In [22]:
df = df.reset_index()
df

     Name  Age      City
0    John   25  New York
1   Emily   30   Houston
2    Jack   35   Chicago
3  Sophia   40   Houston

`unique()`: Return unique values of Series object.

In [23]:
df.City.unique()

array(['New York', 'Houston', 'Chicago'], dtype=object)

`nunique()`: Return number of unique elements in a Series object.

In [24]:
df.City.nunique()

3

`value_counts()`: Return a Series containing counts of unique values.

In [25]:
df.City.value_counts(dropna=False)

City
Houston     2
New York    1
Chicago     1
Name: count, dtype: int64

## 3. Loading Data into Pandas

Pandas provides convenient functions for reading data from various sources into DataFrames.

### 3.1. CSV (Comma-Separated Values) files

In [26]:
df_fortune = pd.read_csv("./data/fortune1000.csv", header="infer", sep=",")
df_fortune

,Company,Revenues,Profits,Employees,Sector,Industry
0,Walmart,500343.0,9862.0,2300000,Retailing,General Merchandisers
1,Exxon Mobil,244363.0,19710.0,71200,Energy,Petroleum Refining
2,Berkshire Hathaway,242137.0,44940.0,377000,Financials,Insurance: Property and Casualty (Stock)
3,Apple,229234.0,48351.0,123000,Technology,"Computers, Office Equipment"
4,UnitedHealth Group,201159.0,10558.0,260000,Health Care,Health Care: Insurance and Managed Care
...,...,...,...,...,...,...
995,SiteOne Landscape Supply,1862.0,54.6,3664,Wholesalers,Wholesalers: Diversified
996,Charles River Laboratories Intl,1858.0,123.4,11800,Health Care,Health Care: Pharmacy and Other Services
997,CoreLogic,1851.0,152.2,5900,Business Services,Financial Data Services
998,Ensign Group,1849.0,40.5,21301,Health Care,Health Care: Medical Facilities
999,HCP,1848.0,414.2,190,Financials,Real estate

In [27]:
df_fortune.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Company    1000 non-null   object
 1   Revenues   1000 non-null   float64
 2   Profits    998 non-null    float64
 3   Employees  1000 non-null   int64
 4   Sector     1000 non-null   object
 5   Industry   1000 non-null   object
dtypes: float64(2), int64(1), object(3)
memory usage: 47.0+ KB

### 3.2. Excel files

In [28]:
# Dependency: You must install openpyxl
# df_excel = pd.read_excel("./data/fortune1000.xlsx")
# df_excel

## 4. Selection and indexing

Pandas provides several strategies to select and index the contents of Series and DataFrames.

### 4.1. Series

#### 4.1.1. Accessing Elements

You can access elements of a Series directly using square brackets [] or by using the index label:

In [29]:
# Create a sample Series
seasons = pd.Series(["winter", "spring", "summer", "fall"])
seasons

0    winter
1    spring
2    summer
3      fall
dtype: object

In [30]:
# Access Series elements using default indices
print(seasons[0])
print(seasons[1])
# print(seasons[11]) # This fails!

winter
spring

In [31]:
# Create a sample Series with specific indices
savings = pd.Series(
    data=[1000, 500, 750, 250],
    index=["January", "February", "March", "April"]
)
savings

January     1000
February     500
March        750
April        250
dtype: int64

In [32]:
# Accessing a single element by index label
# (this returns a value)
savings["April"]

250

In [33]:
# Accessing a single element by index label
# (this returns a series)
savings[["April"]]

April    250
dtype: int64

In [34]:
# Accessing multiple elements by index labels
savings[["April", "January"]]

April       250
January    1000
dtype: int64

#### 4.1.2. Slicing

You can slice a Series using index labels or integer positions:

In [35]:
# Slicing by index labels (endpoint is included)
savings["January":"March"]

January     1000
February     500
March        750
dtype: int64

In [36]:
# Slicing by implicit integer index (endpoint is not included)
savings[1:3]

February    500
March       750
dtype: int64

#### 4.1.3. Boolean Indexing

Boolean indexing allows you to select elements based on a condition:

In [37]:
# Selecting elements where values meet a condition
savings[savings != 500]

January    1000
March       750
April       250
dtype: int64

### 4.2. DataFrames

#### 4.2.1. Accesing columns

You can access columns of a DataFrame directly using square brackets [] or dot notation:

In [38]:
df_fortune.head(1)

   Company  Revenues  Profits  Employees     Sector               Industry
0  Walmart  500343.0   9862.0    2300000  Retailing  General Merchandisers

In [39]:
# Accessing a single column using []
# (return column as a Series)
df_fortune["Company"]

0                              Walmart
1                          Exxon Mobil
2                   Berkshire Hathaway
3                                Apple
4                   UnitedHealth Group
                    ...
995           SiteOne Landscape Supply
996    Charles River Laboratories Intl
997                          CoreLogic
998                       Ensign Group
999                                HCP
Name: Company, Length: 1000, dtype: object

In [40]:
# Accessing a single column using dot notation
# (also return column as a Series)
df_fortune.Company

0                              Walmart
1                          Exxon Mobil
2                   Berkshire Hathaway
3                                Apple
4                   UnitedHealth Group
                    ...
995           SiteOne Landscape Supply
996    Charles River Laboratories Intl
997                          CoreLogic
998                       Ensign Group
999                                HCP
Name: Company, Length: 1000, dtype: object

In [41]:
# Accessing a single column using []
# (return a DataFrame with a single column)
df_fortune[["Company"]]

                             Company
0                            Walmart
1                        Exxon Mobil
2                 Berkshire Hathaway
3                              Apple
4                 UnitedHealth Group
..                               ...
995         SiteOne Landscape Supply
996  Charles River Laboratories Intl
997                        CoreLogic
998                     Ensign Group
999                              HCP

[1000 rows x 1 columns]

In [42]:
df_fortune.head(1)

   Company  Revenues  Profits  Employees     Sector               Industry
0  Walmart  500343.0   9862.0    2300000  Retailing  General Merchandisers

In [43]:
# Accessing multiple columns
# (columns can be returned in different order)
df_fortune[["Employees", "Company"]]

     Employees                          Company
0      2300000                          Walmart
1        71200                      Exxon Mobil
2       377000               Berkshire Hathaway
3       123000                            Apple
4       260000               UnitedHealth Group
..         ...                              ...
995       3664         SiteOne Landscape Supply
996      11800  Charles River Laboratories Intl
997       5900                        CoreLogic
998      21301                     Ensign Group
999        190                              HCP

[1000 rows x 2 columns]

You can also use the `filter()` method to retrieve columns:

In [44]:
# Here "axis" can be omited since it's the default value
df_fortune.filter(items=["Company", "Profits"], axis="columns")

                             Company  Profits
0                            Walmart   9862.0
1                        Exxon Mobil  19710.0
2                 Berkshire Hathaway  44940.0
3                              Apple  48351.0
4                 UnitedHealth Group  10558.0
..                               ...      ...
995         SiteOne Landscape Supply     54.6
996  Charles River Laboratories Intl    123.4
997                        CoreLogic    152.2
998                     Ensign Group     40.5
999                              HCP    414.2

[1000 rows x 2 columns]

In [45]:
# Access columns based on name patterns
df_fortune.filter(like="o", axis=1)

                             Company  Profits  Employees             Sector
0                            Walmart   9862.0    2300000          Retailing
1                        Exxon Mobil  19710.0      71200             Energy
2                 Berkshire Hathaway  44940.0     377000         Financials
3                              Apple  48351.0     123000         Technology
4                 UnitedHealth Group  10558.0     260000        Health Care
..                               ...      ...        ...                ...
995         SiteOne Landscape Supply     54.6       3664        Wholesalers
996  Charles River Laboratories Intl    123.4      11800        Health Care
997                        CoreLogic    152.2       5900  Business Services
998                     Ensign Group     40.5      21301        Health Care
999                              HCP    414.2        190         Financials

[1000 rows x 4 columns]

In [46]:
# Access columns based on name patterns
df_fortune.filter(regex="^R", axis=1)

     Revenues
0    500343.0
1    244363.0
2    242137.0
3    229234.0
4    201159.0
..        ...
995    1862.0
996    1858.0
997    1851.0
998    1849.0
999    1848.0

[1000 rows x 1 columns]

#### 4.2.2. Accessing rows

You can use [] for slicing or boolean indexing to access the rows:

In [47]:
# Slicing by integer positions (exclusive of endpoint)
df_fortune[0:10]

,Company,Revenues,Profits,Employees,Sector,Industry
0,Walmart,500343.0,9862.0,2300000,Retailing,General Merchandisers
1,Exxon Mobil,244363.0,19710.0,71200,Energy,Petroleum Refining
2,Berkshire Hathaway,242137.0,44940.0,377000,Financials,Insurance: Property and Casualty (Stock)
3,Apple,229234.0,48351.0,123000,Technology,"Computers, Office Equipment"
4,UnitedHealth Group,201159.0,10558.0,260000,Health Care,Health Care: Insurance and Managed Care
5,McKesson,198533.0,5070.0,64500,Wholesalers,Wholesalers: Health Care
6,CVS Health,184765.0,6622.0,203000,Health Care,Health Care: Pharmacy and Other Services
7,Amazon.com,177866.0,3033.0,566000,Retailing,Internet Services and Retailing
8,AT&T,160546.0,29450.0,254000,Telecommunications,Telecommunications
9,General Motors,157311.0,-3864.0,180000,Motor Vehicles & Parts,Motor Vehicles and Parts

In [48]:
# Conditional selection using boolean indexing
df_fortune[df_fortune.Employees <= 1000]

,Company,Revenues,Profits,Employees,Sector,Industry
403,A-Mark Precious Metals,6990.0,7.1,126,Materials,Miscellaneous
501,Host Hotels & Resorts,5387.0,564.0,205,Financials,Real estate
576,Welltower,4317.0,522.8,392,Financials,Real estate
613,American Equity Investment Life,3892.0,174.6,515,Financials,"Insurance: Life, Health (stock)"
617,Crestwood Equity Partners,3881.0,-191.9,954,Energy,Energy
635,Antero Resources,3656.0,615.1,593,Energy,"Mining, Crude-Oil Production"
651,Ventas,3574.0,1356.5,493,Financials,Real estate
757,Sprague Resources,2855.0,29.5,981,Wholesalers,Wholesalers: Diversified
761,Colony NorthStar,2842.0,-197.9,544,Financials,Real estate
765,Annaly Capital Management,2809.0,1569.6,152,Financials,Diversified Financials
772,Park Hotels & Resorts,2791.0,2625.0,520,Financials,Real estate
805,Range Resources,2611.0,333.1,773,Energy,"Mining, Crude-Oil Production"
808,Boston Properties,2602.0,462.4,740,Financials,Real estate
844,Par Pacific Holdings,2443.0,72.6,905,Energy,Petroleum Refining
877,Knights of Columbus,2290.0,108.1,926,Financials,"Insurance: Life, Health (Mutual)"
899,Cboe Global Markets,2229.0,401.7,889,Financials,Securities
913,Hospitality Properties Trust,2172.0,215.1,450,Financials,Real estate
917,Renewable Energy Group,2158.0,-79.1,853,Energy,Energy
929,Oaktree Capital Group,2100.0,231.5,930,Financials,Securities
980,Cimarex Energy,1918.0,494.3,910,Energy,"Mining, Crude-Oil Production"
999,HCP,1848.0,414.2,190,Financials,Real estate

In [49]:
# Conditional selection using boolean indexing (&, and, |, or)
df_fortune[(df_fortune.Profits < 0) | (df_fortune.Revenues < 1000)]

,Company,Revenues,Profits,Employees,Sector,Industry
9,General Motors,157311.0,-3864.0,180000,Motor Vehicles & Parts,Motor Vehicles and Parts
17,General Electric,122274.0,-5786.0,313000,Industrials,Industrial Machinery
31,Citigroup,87966.0,-6798.0,209000,Financials,Commercial Banks
34,Dell Technologies,78660.0,-3728.0,145000,Technology,"Computers, Office Equipment"
52,Albertsons Cos.,59678.0,-373.3,273000,Food & Drug Stores,Food and Drug Stores
...,...,...,...,...,...,...
975,Engility Holdings,1932.0,-35.2,8700,Aerospace & Defense,Aerospace and Defense
976,Ferrellgas Partners,1930.0,-54.2,3891,Energy,Energy
988,Aerojet Rocketdyne Holdings,1877.0,-9.2,5157,Aerospace & Defense,Aerospace and Defense
990,Superior Energy Services,1874.0,-205.9,6400,Energy,"Oil and Gas Equipment, Services"
991,VeriFone Systems,1871.0,-173.8,5600,Technology,Financial Data Services

In pandas, the `query()` method allows you to extract DataFrame rows by specifying conditions through a query string, using comparison operators, string methods, logical combinations, and more:

In [50]:
# Comparison involving numbers
df_fortune.query("Profits == 0")

          Company  Revenues  Profits  Employees     Sector   Industry
865  MPM Holdings    2331.0      0.0       5200  Chemicals  Chemicals

In [51]:
# Comparison involving texts
df_fortune.query('Industry == "Chemicals"').head()

              Company  Revenues  Profits  Employees     Sector   Industry
46          DowDuPont   62683.0   1460.0      98000  Chemicals  Chemicals
189  Sherwin-Williams   14984.0   1772.3      52695  Chemicals  Chemicals
190    PPG Industries   14967.0   1591.0      47200  Chemicals  Chemicals
198          Monsanto   14640.0   2260.0      21900  Chemicals  Chemicals
214            Ecolab   13838.0   1508.4      48400  Chemicals  Chemicals

In [52]:
# Comparison operators involving variables
value = 1000
df_fortune.query("Profits >= @value")

,Company,Revenues,Profits,Employees,Sector,Industry
0,Walmart,500343.0,9862.0,2300000,Retailing,General Merchandisers
1,Exxon Mobil,244363.0,19710.0,71200,Energy,Petroleum Refining
2,Berkshire Hathaway,242137.0,44940.0,377000,Financials,Insurance: Property and Casualty (Stock)
3,Apple,229234.0,48351.0,123000,Technology,"Computers, Office Equipment"
4,UnitedHealth Group,201159.0,10558.0,260000,Health Care,Health Care: Insurance and Managed Care
...,...,...,...,...,...,...
765,Annaly Capital Management,2809.0,1569.6,152,Financials,Diversified Financials
769,Ciena,2802.0,1262.0,5737,Technology,Network and Other Communications Equipment
772,Park Hotels & Resorts,2791.0,2625.0,520,Financials,Real estate
796,Public Storage,2669.0,1442.2,5600,Financials,Real estate
804,Prologis,2618.0,1652.3,1565,Financials,Real estate

In [53]:
# Comparison operators involving variables
value = 1000
df_fortune.query(f"Employees >= {value}")

,Company,Revenues,Profits,Employees,Sector,Industry
0,Walmart,500343.0,9862.0,2300000,Retailing,General Merchandisers
1,Exxon Mobil,244363.0,19710.0,71200,Energy,Petroleum Refining
2,Berkshire Hathaway,242137.0,44940.0,377000,Financials,Insurance: Property and Casualty (Stock)
3,Apple,229234.0,48351.0,123000,Technology,"Computers, Office Equipment"
4,UnitedHealth Group,201159.0,10558.0,260000,Health Care,Health Care: Insurance and Managed Care
...,...,...,...,...,...,...
994,Healthcare Services Group,1866.0,88.2,55000,Health Care,Health Care: Pharmacy and Other Services
995,SiteOne Landscape Supply,1862.0,54.6,3664,Wholesalers,Wholesalers: Diversified
996,Charles River Laboratories Intl,1858.0,123.4,11800,Health Care,Health Care: Pharmacy and Other Services
997,CoreLogic,1851.0,152.2,5900,Business Services,Financial Data Services
998,Ensign Group,1849.0,40.5,21301,Health Care,Health Care: Medical Facilities

In [54]:
# Comparison operators involving variables
value = "Health Care"
df_fortune.query(f"Sector != '{value}'")

,Company,Revenues,Profits,Employees,Sector,Industry
0,Walmart,500343.0,9862.0,2300000,Retailing,General Merchandisers
1,Exxon Mobil,244363.0,19710.0,71200,Energy,Petroleum Refining
2,Berkshire Hathaway,242137.0,44940.0,377000,Financials,Insurance: Property and Casualty (Stock)
3,Apple,229234.0,48351.0,123000,Technology,"Computers, Office Equipment"
5,McKesson,198533.0,5070.0,64500,Wholesalers,Wholesalers: Health Care
...,...,...,...,...,...,...
992,Childrens Place,1870.0,84.7,9800,Retailing,Specialty Retailers: Apparel
993,Tribune Media,1867.0,194.1,6000,Media,Entertainment
995,SiteOne Landscape Supply,1862.0,54.6,3664,Wholesalers,Wholesalers: Diversified
997,CoreLogic,1851.0,152.2,5900,Business Services,Financial Data Services
999,HCP,1848.0,414.2,190,Financials,Real estate

In [55]:
# Comparison with the `in` operator
df_fortune.query("Sector not in ('Retailing', 'Wholesalers')")

,Company,Revenues,Profits,Employees,Sector,Industry
1,Exxon Mobil,244363.0,19710.0,71200,Energy,Petroleum Refining
2,Berkshire Hathaway,242137.0,44940.0,377000,Financials,Insurance: Property and Casualty (Stock)
3,Apple,229234.0,48351.0,123000,Technology,"Computers, Office Equipment"
4,UnitedHealth Group,201159.0,10558.0,260000,Health Care,Health Care: Insurance and Managed Care
6,CVS Health,184765.0,6622.0,203000,Health Care,Health Care: Pharmacy and Other Services
...,...,...,...,...,...,...
994,Healthcare Services Group,1866.0,88.2,55000,Health Care,Health Care: Pharmacy and Other Services
996,Charles River Laboratories Intl,1858.0,123.4,11800,Health Care,Health Care: Pharmacy and Other Services
997,CoreLogic,1851.0,152.2,5900,Business Services,Financial Data Services
998,Ensign Group,1849.0,40.5,21301,Health Care,Health Care: Medical Facilities
999,HCP,1848.0,414.2,190,Financials,Real estate

In [56]:
# Comparison with the `in` operator
values = ["Retailing", "Wholesalers"]
df_fortune.query("Sector not in @values")

,Company,Revenues,Profits,Employees,Sector,Industry
1,Exxon Mobil,244363.0,19710.0,71200,Energy,Petroleum Refining
2,Berkshire Hathaway,242137.0,44940.0,377000,Financials,Insurance: Property and Casualty (Stock)
3,Apple,229234.0,48351.0,123000,Technology,"Computers, Office Equipment"
4,UnitedHealth Group,201159.0,10558.0,260000,Health Care,Health Care: Insurance and Managed Care
6,CVS Health,184765.0,6622.0,203000,Health Care,Health Care: Pharmacy and Other Services
...,...,...,...,...,...,...
994,Healthcare Services Group,1866.0,88.2,55000,Health Care,Health Care: Pharmacy and Other Services
996,Charles River Laboratories Intl,1858.0,123.4,11800,Health Care,Health Care: Pharmacy and Other Services
997,CoreLogic,1851.0,152.2,5900,Business Services,Financial Data Services
998,Ensign Group,1849.0,40.5,21301,Health Care,Health Care: Medical Facilities
999,HCP,1848.0,414.2,190,Financials,Real estate

In [57]:
# Comparison with the `not` operator
values = ["Media", "Energy"]
df_fortune.query("Sector not in @values")

,Company,Revenues,Profits,Employees,Sector,Industry
0,Walmart,500343.0,9862.0,2300000,Retailing,General Merchandisers
2,Berkshire Hathaway,242137.0,44940.0,377000,Financials,Insurance: Property and Casualty (Stock)
3,Apple,229234.0,48351.0,123000,Technology,"Computers, Office Equipment"
4,UnitedHealth Group,201159.0,10558.0,260000,Health Care,Health Care: Insurance and Managed Care
5,McKesson,198533.0,5070.0,64500,Wholesalers,Wholesalers: Health Care
...,...,...,...,...,...,...
995,SiteOne Landscape Supply,1862.0,54.6,3664,Wholesalers,Wholesalers: Diversified
996,Charles River Laboratories Intl,1858.0,123.4,11800,Health Care,Health Care: Pharmacy and Other Services
997,CoreLogic,1851.0,152.2,5900,Business Services,Financial Data Services
998,Ensign Group,1849.0,40.5,21301,Health Care,Health Care: Medical Facilities
999,HCP,1848.0,414.2,190,Financials,Real estate

In [58]:
# Chained comparison
df_fortune.query("1000 <= Employees <= 1500")

,Company,Revenues,Profits,Employees,Sector,Industry
469,KKR,5930.0,1018.3,1184,Financials,Securities
488,Cheniere Energy,5601.0,-393.0,1230,Energy,Energy
637,Landstar System,3649.0,177.1,1273,Transportation,"Trucking, Truck Leasing"
647,Green Plains,3596.0,61.1,1427,Energy,Energy
711,Mutual of America Life Insurance,3163.0,26.2,1079,Financials,"Insurance: Life, Health (Mutual)"
719,Continental Resources,3121.0,789.4,1127,Energy,"Mining, Crude-Oil Production"
751,Apollo Global Management,2884.0,629.1,1047,Financials,Securities
764,TRI Pointe Group,2810.0,187.2,1251,Engineering & Construction,Homebuilders
812,Concho Resources,2586.0,956.0,1203,Energy,"Mining, Crude-Oil Production"
815,MDC Holdings,2578.0,141.8,1491,Engineering & Construction,Homebuilders
838,Digital Realty Trust,2458.0,248.3,1429,Financials,Real estate
883,NLV Financial,2275.0,259.9,1065,Financials,"Insurance: Life, Health (stock)"
885,New Jersey Resources,2269.0,132.1,1052,Energy,Energy
901,Murphy Oil,2226.0,-311.8,1128,Energy,"Mining, Crude-Oil Production"
934,SemGroup,2082.0,-17.2,1220,Energy,Pipelines
953,California Resources,2006.0,-266.0,1450,Energy,"Mining, Crude-Oil Production"
962,M/I Homes,1962.0,72.1,1238,Engineering & Construction,Homebuilders
977,Interactive Brokers Group,1927.0,76.0,1228,Financials,Securities
982,Beazer Homes USA,1916.0,31.8,1100,Engineering & Construction,Homebuilders
985,Ohio National Mutual,1907.0,25.9,1300,Financials,"Insurance: Life, Health (stock)"

In [59]:
# Multiple comparisons
# (logical AND can be represented as either & or `and`)
df_fortune.query("Sector == 'Financials' and Profits <= 0")

,Company,Revenues,Profits,Employees,Sector,Industry
31,Citigroup,87966.0,-6798.0,209000,Financials,Commercial Banks
59,AIG,49520.0,-6084.0,49800,Financials,Insurance: Property and Casualty (Stock)
155,Hartford Financial Services,19228.0,-3131.0,16400,Financials,Insurance: Property and Casualty (Stock)
252,Farmers Insurance Exchange,12072.0,-65.4,13015,Financials,Insurance: Property and Casualty (Mutual)
306,Voya Financial,9660.0,-2992.0,6300,Financials,Diversified Financials
468,AmTrust Financial Services,5959.0,-348.9,9300,Financials,Insurance: Property and Casualty (Stock)
761,Colony NorthStar,2842.0,-197.9,544,Financials,Real estate

In [60]:
# Multiple comparisons
# (logical OR can be represented as either | or `or`)
df_fortune.query("Sector == 'Financials' | Employees >= 10000")

,Company,Revenues,Profits,Employees,Sector,Industry
0,Walmart,500343.0,9862.0,2300000,Retailing,General Merchandisers
1,Exxon Mobil,244363.0,19710.0,71200,Energy,Petroleum Refining
2,Berkshire Hathaway,242137.0,44940.0,377000,Financials,Insurance: Property and Casualty (Stock)
3,Apple,229234.0,48351.0,123000,Technology,"Computers, Office Equipment"
4,UnitedHealth Group,201159.0,10558.0,260000,Health Care,Health Care: Insurance and Managed Care
...,...,...,...,...,...,...
989,Barnes & Noble Education,1874.0,5.4,13375,Retailing,Specialty Retailers: Other
994,Healthcare Services Group,1866.0,88.2,55000,Health Care,Health Care: Pharmacy and Other Services
996,Charles River Laboratories Intl,1858.0,123.4,11800,Health Care,Health Care: Pharmacy and Other Services
998,Ensign Group,1849.0,40.5,21301,Health Care,Health Care: Medical Facilities
999,HCP,1848.0,414.2,190,Financials,Real estate

#### 4.2.3. Selecting Rows and Columns using `loc[]` and `iloc[]`

When using `[]`, you can only select from one axis at once (rows or columns, not both). For more advanced indexing, Pandas provides two extra attributes: `loc[]` and `iloc[]`.

##### 4.2.3.1. `loc[]`

<u>Label-based</u> indexing for selecting rows and columns by their labels.

In [61]:
# Practice dataframe
df2 = pd.DataFrame(
    {
        "Yellow": [False, False, True, True],
        "Green": [True, True, True, True],
        "Blue": [False, False, False, False]
    },
    index=["Apple", "Avocado", "Orange", "Mango"]
)
df2

         Yellow  Green   Blue
Apple     False   True  False
Avocado   False   True  False
Orange     True   True  False
Mango      True   True  False

In [62]:
# Selecting a single row by label
# (return the row as a Series)
df2.loc["Apple"]

Yellow    False
Green      True
Blue      False
Name: Apple, dtype: bool

In [63]:
# Selecting a single row by label
# (return the row as a DataFrame)
df2.loc[["Apple"]]

       Yellow  Green   Blue
Apple   False   True  False

In [64]:
# Selecting multiple rows by labels
df2.loc[["Apple", "Orange"]]

        Yellow  Green   Blue
Apple    False   True  False
Orange    True   True  False

In [65]:
# Selecting multiple rows by labels
df2.loc["Avocado":"Mango"]

         Yellow  Green   Blue
Avocado   False   True  False
Orange     True   True  False
Mango      True   True  False

In [66]:
# Selecting a single column by label
df2.loc[:, "Blue"]

Apple      False
Avocado    False
Orange     False
Mango      False
Name: Blue, dtype: bool

In [67]:
# Selecting a multiple columns by label
df2.loc[:, "Yellow":"Blue"]

         Yellow  Green   Blue
Apple     False   True  False
Avocado   False   True  False
Orange     True   True  False
Mango      True   True  False

In [68]:
# Selecting a multiple columns by label
df2.loc[:, ["Blue", "Green"]]

          Blue  Green
Apple    False   True
Avocado  False   True
Orange   False   True
Mango    False   True

In [69]:
# Single label for row and column
df2.loc["Avocado", "Yellow"]

False

In [70]:
# Selecting multiple rows and columns by labels
df2.loc[["Mango", "Avocado"], "Blue"]

Mango      False
Avocado    False
Name: Blue, dtype: bool

In [71]:
# Selecting multiple rows and columns by labels
df2.loc[["Mango", "Avocado"], ["Blue", "Yellow"]]

          Blue  Yellow
Mango    False    True
Avocado  False   False

In [72]:
# Selecting using boolean indexing
df2.loc[:, ]

         Yellow  Green   Blue
Apple     False   True  False
Avocado   False   True  False
Orange     True   True  False
Mango      True   True  False

##### 4.2.3.2. `iloc[]`

<u>Integer-based</u> indexing for selecting rows and columns by their integer positions. It works similar as indexing `numpy` arrays:

In [73]:
# Selecting a single row by index
# (return the row as a Series)
df2.iloc[0]

Yellow    False
Green      True
Blue      False
Name: Apple, dtype: bool

In [74]:
# Selecting a single row by index
# (return the row as a DataFrame)
df2.iloc[[0]]

       Yellow  Green   Blue
Apple   False   True  False

In [75]:
# Selecting multiple rows by index
df2.iloc[[1, 2]]

         Yellow  Green   Blue
Avocado   False   True  False
Orange     True   True  False

In [76]:
# Selecting multiple rows by index
df2.iloc[1:3]

         Yellow  Green   Blue
Avocado   False   True  False
Orange     True   True  False

In [77]:
# Selecting a single column by index
df2.iloc[:, -1]

Apple      False
Avocado    False
Orange     False
Mango      False
Name: Blue, dtype: bool

In [78]:
# Selecting a multiple columns by index
df2.iloc[:, 0:1]

         Yellow
Apple     False
Avocado   False
Orange     True
Mango      True

In [79]:
# Selecting a multiple columns by index
df2.iloc[:, [2, 0]]

          Blue  Yellow
Apple    False   False
Avocado  False   False
Orange   False    True
Mango    False    True

In [80]:
# Single label for row and column
df2.iloc[0, 0]

False

In [81]:
# Selecting multiple rows and columns by labels
df2.iloc[[-1, 0], 2]

Mango    False
Apple    False
Name: Blue, dtype: bool

In [82]:
# Selecting multiple rows and columns by labels
df2.iloc[[3, 1], [-1, 0]]

          Blue  Yellow
Mango    False    True
Avocado  False   False

In [83]:
# Selecting using boolean indexing
df2.iloc[2, [False, False, True]]

Blue    False
Name: Orange, dtype: bool